Revit 2024 API
EnergyAnalysisOpening.Height Property
 The height of the analytical rectangular geometry.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public double Height { get; }
Visual Basic
Public ReadOnly Property Height As Double
	Get
Visual C++
public:
property double Height {
	double get ();
}
See Also
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace